Revit 2026 API

# ViewEnableRevealHiddenMode Method

---

Enables Reveal Hidden elements mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void EnableRevealHiddenMode()
```
```vb
Public Sub EnableRevealHiddenMode
```
```cpp
public:
void EnableRevealHiddenMode()
```
```fsharp
member EnableRevealHiddenMode : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | View cannot use temporary visibility modes. |

#### Reference

View Class

Autodesk.Revit.DB Namespace